<script setup lang="ts">
import { type Directive, onMounted, onUnmounted, type PropType, reactive, ref } from 'vue'
import { loadDiffConfig } from 'vitest/browser'
import { convertFileSrc } from '@tauri-apps/api/core'

/*
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* ==================================================================================================
* 无法直接通过组件的方式进行绑定，因为在使用 v-for 进行渲染时，v-for 中的插件只有全部进入视野对应的 IntersectionObserver
* 才能触发，无法满足要求
*
* 使用示例：
*                     <LazyImage  :get-img-src="getImg" :original-image-path="col">
                      <template  #loading>
          <!--              <img-->
          <!--                class="absolute top-0 left-0 w-full h-full object-cover rounded-t-lg img-load"-->
          <!--                src="@/assets/images/img_example.png"-->
          <!--                alt=""-->
          <!--              />-->
                      </template>
                      <template #error>
                        <div>报错！！！！！！！！！！！！！！！！！！！！</div>
          <!--              <img-->
          <!--                class="absolute top-0 left-0 w-full h-full object-cover rounded-t-lg img-load"-->
          <!--                src="@/assets/images/img_example_not_exist.png"-->
          <!--                alt=""-->
          <!--              />-->
                      </template>
                      <template #default="{ src, isError, isLoading }">
                        <img
                          :class="isError || isLoading ? 'img-load' : ''"
                          class="absolute top-0 left-0 w-full h-full object-cover rounded-t-lg"
                          :src="src"
                          alt=""
                        />
                      </template>
                    </LazyImage>

*
*
*
*
*
* ==================================================================================================
* */

let rootEle = ref()
// 是否正在监听
let isListening = true
// 最终图片地址
let endResultPath = ref('')

const props = defineProps({
  // 是否加载
  loading: {
    type: Boolean,
    default: true
  },
  // 是否出错
  error: Boolean,
  // 错误提示信息
  errorMsg: String,
  // 请求图片信息
  getImgSrc: {
    type: Function as PropType<(path: string) => Promise<string>>,
    required: true
  },
  // 原始图片地址
  originalImagePath: {
    type: String,
    required: true
  }
})
// 将 props 中的值复制到响应式对象中
const state = reactive({
  loading: props.loading,
  error: props.error,
  errorMsg: props.errorMsg,
  imgSrc: ''
})
const observer = new IntersectionObserver((entries) => {
  entries.forEach(
    (entry) => {
      console.log("1231");
      if (isListening && entry.isIntersecting) {
        if (props !== null && props !== undefined) {
          let s = props.getImgSrc!(props.originalImagePath)
          s.then((e) => {
            endResultPath.value = convertFileSrc(e)
            state.loading = false
          })
            .catch((e) => {
              console.error(e)
              state.error = true
              state.errorMsg = e.toString()
            })
            .finally(() => {
              isListening = false
              if (rootEle.value) {
                console.log();
                observer.unobserve(rootEle.value)
              }
            })
        }
      }
    }
  )
},
  {
    threshold: [0] // 当元素至少有 10% 进入视口时触发回调
  })

onMounted(() => {
  observer.observe(rootEle.value)
})

onUnmounted(() => {
  observer.unobserve(rootEle.value)
})
// 获取图片
</script>

<template>
  <div  class="bg-red-300">
    <!--  loading-->
    <div ref="rootEle" v-if="state.loading">
      <slot name="loading"></slot>
    </div>
    <!--  error-->
    <div v-else-if="state.error">
      <div>报错了!!</div>
      <slot name="error"></slot>
    </div>
    <!--  正常展示-->
    <div v-else>
      <slot :src="endResultPath" :isLoading="state.loading" :isError="state.error" />
    </div>
  </div>
</template>

<style scoped></style>
